testfile/app/controllers/resumes_controller.rb

   def index
      @resumes = Resume.all
---
SELECT "resumes".* FROM "resumes"

   def create
      @resume = Resume.new(resume_params)

      if @resume.save
---
INSERT INTO "resumes" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sk"], ["attachment", "CDSP_JIRA_Apr_Peritus_05Apr.xls"], ["created_at", "2016-07-25 10:17:51.745064"], ["updated_at", "2016-07-25 10:17:51.745064"]]

   def destroy
      @resume = Resume.find(params[:id])
      @resume.destroy
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 1]]